simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static const char *psocCalStageName(uint8_t stage)
{
    switch (stage) {
        case 0:  return "GEO_PGA";
        case 1:  return "GEO_BP";
        case 2:  return "GEO_ADDER";
        case 3:  return "GEO_LP";
        default: return "UNKNOWN";
    }
}

static void onPsocDiag(const PsocDiagEvent &event)
{
    const char *eventName = psocDiagName(event.event);
    const char *stateName = psocStateName(event.psoc_state);
    static uint8_t calStage = 0xFF;
    static uint8_t calDac = 0;
    static int16_t calMeas = 0;
    static bool calMeasHigh = false;
    static uint32_t calMeasRaw = 0;
    static uint8_t calMeasRawByte = 0;
    g_psocConnected = true;

    if (g_state == SAMPLING && event.event != PSOC_EVT_DUMP_DONE) {
        return;
    }

    if (event.event == PSOC_EVT_DUMP_DONE && g_view_store_active &&
        g_state == SAMPLING && g_store_fill < g_rec_n_batches) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        g_view_store_active = false;
        g_state = STOPPED;
        sendCfgAck(CMD_VIEW, 0);
        SLAVE_LOG_PRINTF("[SLAVE] VIEW partial dump fill=%u/%u -> FAIL\n",
                         (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
        LOGM("VIEW_PARTIAL", "fill=%u,n=%u,bOK=%lu,bBad=%lu,drop=%lu,bytes=%lu",
             (unsigned)g_store_fill, (unsigned)g_rec_n_batches,
             (unsigned long)psoc.batchesOK(),
             (unsigned long)psoc.batchesBad(),
             (unsigned long)psoc.syncDrops(),
             (unsigned long)psoc.bytesRx());
    }

    if (event.event == PSOC_EVT_CAL_STAGE_BEGIN) {
        calStage = event.value;
        calMeasHigh = false;
        calMeasRawByte = 0;
        SLAVE_LOG_PRINTF("[SLAVE] CAL begin stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_BEGIN", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_VERIFY_BEGIN) {
        calStage = event.value;
        calMeasHigh = false;
        calMeasRawByte = 0;
        SLAVE_LOG_PRINTF("[SLAVE] CAL verify begin stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_VERIFY_BEGIN", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_STAGE_DAC) {
        calDac = event.value;
    } else if (event.event == PSOC_EVT_CAL_STAGE_MEAS) {
        if (!calMeasHigh) {
            calMeas = (int16_t)((uint16_t)event.value << 8);
            calMeasHigh = true;
        } else {
            calMeas = (int16_t)((uint16_t)calMeas | event.value);
            calMeasHigh = false;
            SLAVE_LOG_PRINTF("[SLAVE] CAL point stage=%u/%s dac=%u meas=%d\n",
                             calStage, psocCalStageName(calStage),
                             calDac, (int)calMeas);
            LOGM("CAL_POINT", "stage=%u,name=%s,dac=%u,meas=%d",
                 calStage, psocCalStageName(calStage), calDac, (int)calMeas);
        }
    } else if (event.event == PSOC_EVT_CAL_STAGE_MEAS32) {
        calMeasRaw = (calMeasRaw << 8) | event.value;
        calMeasRawByte++;
        if (calMeasRawByte >= 4) {
            calMeasRawByte = 0;
            SLAVE_LOG_PRINTF("[SLAVE] CAL point32 stage=%u/%s dac=%u measRaw=%ld\n",
                             calStage, psocCalStageName(calStage),
                             calDac, (long)(int32_t)calMeasRaw);
            LOGM("CAL_POINT32", "stage=%u,name=%s,dac=%u,measRaw=%ld",
                 calStage, psocCalStageName(calStage), calDac,
                 (long)(int32_t)calMeasRaw);
        }
    } else if (event.event == PSOC_EVT_CAL_STAGE_OK) {
        SLAVE_LOG_PRINTF("[SLAVE] CAL result stage=%u/%s ok=%u dac=%u meas=%d\n",
                         calStage, psocCalStageName(calStage), event.value,
                         calDac, (int)calMeas);
        LOGM("CAL_STAGE", "stage=%u,name=%s,ok=%u,dac=%u,meas=%d",
             calStage, psocCalStageName(calStage), event.value,
             calDac, (int)calMeas);
    } else if (event.event == PSOC_EVT_CAL_VERIFY_OK) {
        SLAVE_LOG_PRINTF("[SLAVE] CAL verify stage=%u/%s ok=%u dac=%u meas=%d\n",
                         calStage, psocCalStageName(calStage), event.value,
                         calDac, (int)calMeas);
        LOGM("CAL_VERIFY", "stage=%u,name=%s,ok=%u,dac=%u,meas=%d",
             calStage, psocCalStageName(calStage), event.value,
             calDac, (int)calMeas);
    } else if (event.event == PSOC_EVT_CAL_AMUX_IN) {
        SLAVE_LOG_PRINTF("[SLAVE] CAL AMux_IN -> %u (%s)\n", event.value,
                         event.value == 0 ? "normal/captura" : "referencia/tierra virtual");
        LOGM("CAL_AMUX_IN", "channel=%u", event.value);
    } else if (event.event == PSOC_EVT_CAL_PROGRESS) {
        SLAVE_LOG_PRINTF("[SLAVE] CAL progress stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_PROGRESS", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
        /* El "calibrando..." (ok=2) hacia el maestro ya NO depende de este
         * evento: servicePsocConfigAck() lo emite por temporizador propio
         * mientras g_cfg_waiting este activo (ver mas abajo), para que el
         * indicador no dependa de que el stream de diagnostico del PSoC
         * llegue completo. */
    } else if (event.event == PSOC_EVT_CAL_WATCHDOG) {
        SLAVE_LOG_PRINTF("[SLAVE] CAL WATCHDOG timeout en stage=%u/%s -> abortado, valores seguros restaurados\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_WATCHDOG", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_LP_BAD) {
        SLAVE_LOG_PRINTF("[SLAVE] *** CAL CRITICO *** stage=%u/%s (GEO_LP, etapa de captura) "
                         "quedo fuera de rango incluso en CAL_DAC_INIT -> la captura va a ser inutil\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_LP_BAD", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    }

    SLAVE_LOG_PRINTF("[SLAVE] PSOC_EVT %s event=0x%02X val=%u pstate=%u/%s estate=%d bytes=%lu bOK=%lu fill=%u/%u\n",
                     eventName, event.event, event.value,
                     event.psoc_state, stateName, (int)g_state,
                     (unsigned long)psoc.bytesRx(),
                     (unsigned long)psoc.batchesOK(),
                     (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
    LOGM("PSOC_EVT", "event=0x%02X,name=%s,val=%u,pstate=%u,pstateName=%s,estate=%d,bytes=%lu,bOK=%lu,fill=%u/%u",
         event.event, eventName, event.value,
         event.psoc_state, stateName, (int)g_state,
         (unsigned long)psoc.bytesRx(),
         (unsigned long)psoc.batchesOK(),
         (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
}

/* ── ISR GPIO hardware sync (IRAM para máxima velocidad) ────────────────── */
void IRAM_ATTR onSyncEdge()
{
    int level = digitalRead(SYNC_IN_PIN);
    if (level == HIGH && g_state == HOT_WAIT) {
        digitalWrite(SYNC_TO_PSOC_PIN, HIGH);
        uint32_t nowUs = (uint32_t)micros();
        g_t_start_us    = (uint64_t)nowUs;
        g_store_fill    = 0;
        g_debug_count   = 0;
        g_debug_last_us = nowUs;
        g_state = SAMPLING;
    } else if (level == LOW && g_state == SAMPLING) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        g_state = STOPPED;
    } else if (g_state != SAMPLING) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    }
}

